cljs-rn/cljs-rn.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-12-06 Fri 11:06 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="fgui" />
</head>
<body>
<div id="content">
<p>
#+Title Clojurescript + react native (Android)
</p>

<div id="outline-container-org228e327" class="outline-2">
<h2 id="org228e327"><span class="section-number-2">1</span> Clojurescript + react native (Android)</h2>
<div class="outline-text-2" id="text-1">
<p>
Dev mobile apps with linux written mainly in clojurescript. 
</p>
</div>

<div id="outline-container-org8d9084f" class="outline-3">
<h3 id="org8d9084f"><span class="section-number-3">1.1</span> Setup with shadow-cljs (dec 6 2019)</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-orgf3eec83" class="outline-4">
<h4 id="orgf3eec83"><span class="section-number-4">1.1.1</span> create a react-native project</h4>
<div class="outline-text-4" id="text-1-1-1">
<pre class="example">
react-native init &lt;ProjectName&gt;
cd &lt;ProjectName&gt;
</pre>
</div>
</div>

<div id="outline-container-org0877805" class="outline-4">
<h4 id="org0877805"><span class="section-number-4">1.1.2</span> delete the file App.js</h4>
<div class="outline-text-4" id="text-1-1-2">
<p>
This may change in the future. For now we use index.js
</p>
</div>
</div>

<div id="outline-container-orga79654d" class="outline-4">
<h4 id="orga79654d"><span class="section-number-4">1.1.3</span> replace index.js with the following content</h4>
<div class="outline-text-4" id="text-1-1-3">
<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #ff79c6; font-weight: bold;">import</span><span style="color: #6272a4; background-color: #282a36;"> </span><span style="color: #f1fa8c;">"./build/index.js"</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org7c9c44d" class="outline-4">
<h4 id="org7c9c44d"><span class="section-number-4">1.1.4</span> create the shadow-cljs.edn file with following content</h4>
<div class="outline-text-4" id="text-1-1-4">
<p>
Change your dependecies as you require.
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #f8f8f2;">{</span><span style="color: #8be9fd;">:source-paths</span>
<span style="color: #6272a4; background-color: #282a36;"> </span><span style="color: #8be9fd;">[</span><span style="color: #f1fa8c;">"src/main"</span>
<span style="color: #6272a4; background-color: #282a36;">  </span><span style="color: #f1fa8c;">"src/test"</span><span style="color: #8be9fd;">]</span>

<span style="color: #6272a4; background-color: #282a36;"> </span><span style="color: #8be9fd;">:dependencies</span>
<span style="color: #6272a4; background-color: #282a36;"> </span><span style="color: #8be9fd;">[</span><span style="color: #bd93f9;">[</span><span style="color: #bd93f9;">org.clojure</span>/core.async<span style="color: #6272a4; background-color: #282a36;"> </span><span style="color: #f1fa8c;">"0.4.474"</span><span style="color: #bd93f9;">]</span>
<span style="color: #6272a4; background-color: #282a36;">  </span><span style="color: #bd93f9;">[</span>cljs-http<span style="color: #6272a4; background-color: #282a36;"> </span><span style="color: #f1fa8c;">"0.1.46"</span><span style="color: #bd93f9;">]</span>
<span style="color: #6272a4; background-color: #282a36;">  </span><span style="color: #bd93f9;">[</span>re-frame<span style="color: #6272a4; background-color: #282a36;"> </span><span style="color: #f1fa8c;">"0.11.0-rc3"</span><span style="color: #bd93f9;">]</span>
<span style="color: #6272a4; background-color: #282a36;">  </span><span style="color: #bd93f9;">[</span>reagent<span style="color: #6272a4; background-color: #282a36;"> </span><span style="color: #f1fa8c;">"0.9.0-rc3"</span>
<span style="color: #6272a4; background-color: #282a36;">   </span><span style="color: #8be9fd;">:exclusions</span><span style="color: #6272a4; background-color: #282a36;"> </span><span style="color: #ff79c6;">[</span><span style="color: #bd93f9;">cljsjs</span>/react
<span style="color: #6272a4; background-color: #282a36;">                </span><span style="color: #bd93f9;">cljsjs</span>/react-dom
<span style="color: #6272a4; background-color: #282a36;">                </span><span style="color: #bd93f9;">cljsjs</span>/react-dom-server
<span style="color: #6272a4; background-color: #282a36;">                </span><span style="color: #bd93f9;">cljsjs</span>/create-react-class<span style="color: #ff79c6;">]</span><span style="color: #bd93f9;">]</span><span style="color: #8be9fd;">]</span>

<span style="color: #6272a4; background-color: #282a36;"> </span><span style="color: #8be9fd;">:builds</span>
<span style="color: #6272a4; background-color: #282a36;"> </span><span style="color: #8be9fd;">{</span><span style="color: #8be9fd;">:app</span>
<span style="color: #6272a4; background-color: #282a36;">  </span><span style="color: #bd93f9;">{</span><span style="color: #8be9fd;">:target</span><span style="color: #6272a4; background-color: #282a36;"> </span><span style="color: #8be9fd;">:react-native</span>
<span style="color: #6272a4; background-color: #282a36;">   </span><span style="color: #8be9fd;">:init-fn</span><span style="color: #6272a4; background-color: #282a36;"> </span><span style="color: #bd93f9;">&lt;project-name&gt;.core</span>/init
<span style="color: #6272a4; background-color: #282a36;">   </span><span style="color: #8be9fd;">:output-dir</span><span style="color: #6272a4; background-color: #282a36;"> </span><span style="color: #f1fa8c;">"build"</span><span style="background-color: #ffb86c;"> </span>
<span style="color: #6272a4; background-color: #282a36;">   </span><span style="color: #8be9fd;">:devtools</span><span style="color: #6272a4; background-color: #282a36;"> </span><span style="color: #ff79c6;">{</span><span style="color: #8be9fd;">:autoload</span><span style="color: #6272a4; background-color: #282a36;"> </span><span style="color: #8be9fd;">true</span><span style="color: #ff79c6;">}</span><span style="color: #bd93f9;">}</span><span style="color: #8be9fd;">}</span><span style="color: #f8f8f2;">}</span><span style="background-color: #ffb86c;"> </span>
</pre>
</div>

<p>
not to sure if all the exclusions are needed
</p>
</div>
</div>

<div id="outline-container-orgc73ca5a" class="outline-4">
<h4 id="orgc73ca5a"><span class="section-number-4">1.1.5</span> write some code in <b>src/main/project-name.core.cljs</b> <b>init</b></h4>
<div class="outline-text-4" id="text-1-1-5">
<p>
Like&#x2026;
</p>
<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #f8f8f2;">(</span><span style="color: #ff79c6; font-weight: bold;">defn</span><span style="color: #6272a4; background-color: #282a36;"> </span><span style="color: #50fa7b; font-weight: bold;">init</span><span style="color: #6272a4; background-color: #282a36;"> </span><span style="color: #8be9fd;">[]</span>
<span style="color: #6272a4; background-color: #282a36;">      </span><span style="color: #8be9fd;">(</span>dispatch-sync<span style="color: #6272a4; background-color: #282a36;"> </span><span style="color: #bd93f9;">[</span><span style="color: #8be9fd;">:initialize-db</span><span style="color: #bd93f9;">]</span><span style="color: #8be9fd;">)</span>
<span style="color: #6272a4; background-color: #282a36;">      </span><span style="color: #8be9fd;">(</span>.registerComponent<span style="color: #6272a4; background-color: #282a36;"> </span>app-registry<span style="color: #6272a4; background-color: #282a36;"> </span><span style="color: #f1fa8c;">"geocoder"</span><span style="color: #6272a4; background-color: #282a36;"> </span>#<span style="color: #bd93f9;">(</span><span style="color: #bd93f9;">r</span>/reactify-component<span style="color: #6272a4; background-color: #282a36;"> </span>app-root<span style="color: #bd93f9;">)</span><span style="color: #8be9fd;">)</span><span style="color: #f8f8f2;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org80b91fb" class="outline-4">
<h4 id="org80b91fb"><span class="section-number-4">1.1.6</span> For development</h4>
<div class="outline-text-4" id="text-1-1-6">
<pre class="example">
shadow-cljs watch app

react-native start

react-native run-android
</pre>
</div>
</div>

<div id="outline-container-org5e4812d" class="outline-4">
<h4 id="org5e4812d"><span class="section-number-4">1.1.7</span> Build apk</h4>
<div class="outline-text-4" id="text-1-1-7">
<pre class="example">
shadow-cljs release app

cd android
./gradlew build
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: fgui</p>
<p class="date">Created: 2019-12-06 Fri 11:06</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
